"""
CSV(Comma-Separated Values) - формат, который чаще всего используется для хранения табличных данных

Пример данных в формате csv:

Name, Age, City                  # названия столбцов
Alice, 30, New York              # строки со значениями
Bob, 25, London                  # строки со значениями
Carlos, 28, Moscow               # строки со значениями

CSV используют для экспорта и импорта данных из таблиц, отчетов, систем управления персоналом.
Он очень прост и эффективен для хранения больших объемов данных, особенно, елси вам не нужна сложная структура

"""