"""
Изучим файлы, модули, csv, json 
-------------------------------------------------------------------------
1. Файлы пути
(файл хранит данные на диске и сохраняется после завершения программы)

Относительный путь считается от текущей рабочей папки: data/students.txt
Абсолютный путь содержит полный путь к файлу

Поработаем с модулем os
Он позволяет работать с операционной системой и файлами. Например код ниже при запуске выдаст абсолютный путь к месту:

-------------------------------------------------------------------------
import os

print("Текущая папка: ")
print(os.getcwd())
-------------------------------------------------------------------------

Модуль os содержит в себе множество полезных и интересных методов, которые могут пригодиться в зависимости от задачи. Сейчас мы перейдем к изучению файлов. Если понадобится, то к os мы ещё вернемся.

Мы можем открывать файлы находясь в другом месте, изменять данные внутри них и тд.
Чтобы открыть файл нужно написать open():

-------------------------------------------------------------------------
file = open("connections.yaml") # откроем файл connections.yaml 
-------------------------------------------------------------------------

Давайте прочитаем данные в этом файле. Для этого напишем file.read:

-------------------------------------------------------------------------
print(file.read())
file.close()
-------------------------------------------------------------------------
Не забываем прописать закрытие файла, так как файловые дескрипторы ограничены, чтобы не засорить штучий процессор

Ознакомьтесь с основынми режимами открытия файла("r", "w", "x" и тд)
Теперь давайте откроем файл в режиме чтения как до этого, но записав более корректно:

-------------------------------------------------------------------------
file = open("connections.yaml", "r") 

print(file.read())

file.close()

-------------------------------------------------------------------------
"""

import os

print("Текущая папка: ")
print(os.getcwd())
