"""
JSON(JavaScript Object Notation) - стандартный формат для передачи данных между клиентом и сервером

Пример данных в формате json:

{
    "name": "Alice",
    "age": 30,
    "city": "New York",
    "is_student": false
}

Данные организованы в виде пар(ключ:значение)
Ключи записываются в виде строк с двойными кавычками, а значения могут быть разных типов

JSON полезен, когда необходимо передавать сложные структуры данных(информация о пользователях, списки товаров или данные для мобильного приложения). Он легко читается человеком, что делает его удобным для разработчиков

Перейдем к практике. Научимся записывать данные в формате json в файл

------------------------------------------
import json

# Запись данных в формате json
data = {
    "name": "John",
    "age": 30,
    "city": "New York"
}

with open('data.json', 'w', encoding="utf-8") as file:
    json.dump(data, file)
------------------------------------------

1) Для работы с этим форматом в Python существует молуль json, который нужно импортировать
2) Далее создаем словарь, который мы хотим сохранить в файл
3) Функция open() открывает файл data.json
4) 'w' -  режим записи (write). Если файла нет — он создастся, если есть — его содержимое будет перезаписано
5) encoding="utf-8" — кодировка
6) with ... as file: — конструкция, которая автоматически закроет файл после выхода из блока, даже если внутри произойдёт ошибка
7) json.dump(data, file) - непосредственно сама запись json. Здесь dump сериализует Python-объект data и записывает его в файловый объект file

(Сериализация — это преобразование объекта из памяти программы (в данном случае Python-словаря) в последовательность байтов или текстовый формат, который можно: записать в файл, передать по сети, сохранить в базу данных, а потом восстановить обратно в объект (это называется десериализация)) 

Также можно добавить параметр indent=4 в метод dump для форматирования словаря(перенос строк со сдвигом в 4 пробела)

------------------------------------------
import json

# Запись данных в формате json
data = {
    "name": "John",
    "age": 30,
    "city": "New York"
}

with open('data.json', 'w', encoding="utf-8") as file:
    json.dump(data, file, indent=4)
------------------------------------------

Также мы можем сохранить строку в формате json например в переменной и вызвать её

------------------------------------------
import json

data = {
    "name": "John",
    "age": 30,
    "city": "New York"
}

# Преобразование в строку
json_string = json.dumps(data, ensure_ascii=False, indent=4)
print(json_string)
------------------------------------------

Добавляем s к dump и теперь данные сохраняются в переменную, а не в файл

Теперь давайте попрактикуемся!

1) Создайте словарь товаров: каждый товар должен иметь следующую информацию:
- название (на русском языке)
- цена
- категория
- наличие на складе (true, false) - в формате json булево значение пишется с маленькой буквы
- артикул

2) Создайте список товаров
3) Запишите товары в json файл:
- загрузите данные в файл catalog.json с отступами в 4 пробела
- убедитесь, что данные на русском корректно записаны в файл

Если нужно сохранить файл не в корень проекта, а в папку внутри папки, то следует указать путь в функции open()

import json
lst = [
    {
        "name": "Кофе",
        "price": 2000,
        "category": "Продукты",
        "in_stock": true,
        "sku":  123
    },
    {
        "name": "Смартфон",
        "price": 35000,
        "category": "Электроника",
        "in_stock": true,
        "sku": 122
    },
    {
        "name": "Сахар",
        "price": 60,
        "category": "Продукты",
        "in_stock": false,
        "sku": 124
    },
    {
        "name": "Планшет",
        "price": 40000,
        "category": "Электроника",
        "in_stock": true,
        "sku": 111
    },
    {
        "name": "Микроволновка",
        "price": 12000,
        "category": "Электроника",
        "in_stock": false,
        "sku": 113
    },
]
file_path = r"C:\Users\Victoria\Documents\data_engineer_study/data_enjineering_lessons/file_formats/catalog.json"

with open(file_path, "w", encoding="utf-8") as file:
    json.dump(lst, file, ensure_ascii=False, indent=4)
"""
