'''
-----------------Процедурное и объектно-ориентированное программирорвание-----------------

В программировании применяются два подхода: процедурное и объектно-ориентированное.
Первые яп были процедурными, при этом программа состояла из одной или нескольких процедур.

Процедура - независимая именованная часть программы, которую после однократного описания можно многократно вызвать по имени из последующих частей программы для выполнения определенных действий. 
Процедура может рассматриваться как просто функция, которая выпоняет определенную задачу, такую как сбор вводимых данных, выполнение вычислений, чтение и запись файлов, вывод результатов.

---Процедура и функция имеют общее название - программа.

В отличие от процедурного программирования, в центре которого находится создание процедур, объектно-ориентированное программирование сосредоточено на создании объектов. 

Объект — это программная сущность, которая содержит данные и процедуры. Находящиеся внутри объекта данные называются атрибутами. Атрибуты — это просто переменные, которые ссылаются на данные. Выполняемые объектом процедуры называются методами. Методы объекта — это функции, которые, как правило, выполняют операции с атрибутами.
В концептуальном плане объект представляет собой автономную единицу, которая состоит из атрибутов и методов.

---В объектно-ориентированном программировании атрибуты и методы размещаются в рамках одного объекта, в то время как в процедурном программировании атрибуты и методы обычно разделяются.

ООП решает проблему разделения программного кода и данных посредством инкапсуляции и сокрытия данных. Инкапсуляция обозначает объединение данных и процедур в одном объекте. Сокрытие данных связано со способностью объекта скрывать свои атрибуты от программного кода, который находится за пределами объекта. Только методы объекта могут непосредственно получать доступ и вносить изменения в атрибуты объекта. Объект, как правило, скрывает свои данные, но позволяет внешнему коду получать доступ к своим методам. 

---Инкапсуляцию и сокрытие данных часто объединяют в одно понятие и называют просто инкапсуляцией.

Когда атрибуты объекта скрыты от внешнего кода и доступ к атрибутам данных ограничен методами объекта, атрибуты защищены от случайного повреждения. Кроме того, программному коду за пределами объекта не нужно знать о формате или внутренней структуре данных объекта. Программный код взаимодействует только с методами объекта. Когда программист меняет структуру внутренних атрибутов, он также меняет методы объекта, чтобы они могли должным образом оперировать данными. Однако приемы взаимодействия внешнего кода с методами не меняются.


------------------Преимущества и недостатки ООП------------------

---К преимуществам ООП можно отнести:

Модульность. ООП подход позволяет сделать код более структурированным, в котором легко разобраться стороннему человеку. Благодаря инкапсуляции уменьшается количество ошибок и ускоряется разработка с участием большого количества программистов, потому что каждый может работать независимо друг от друга.

Гибкость. ООП код легко развивать, дополнять и изменять. Взаимодействие с объектами, а не логикой упрощает понимание кода.

Экономия времени. Возможность многократного использования объектов, что позволяет не писать один и тот же код много раз.

Безопасность. Программу сложно сломать, так как инкапсулированный код недоступен извне.

---К недостаткам ООП можно отнести:

Сложный старт. Чтобы пользоваться ООП, нужно сначала изучить теорию и освоить процедурный подход, поэтому порог входа достаточно высок.

Снижение производительности. ООП подход немного снижает производительность кода в целом. Программы работают несколько медленнее из-за особенностей доступа к данным и большого количества сущностей.

Большой размер программы. Код, написанный с использованием ООП, обычно длиннее и занимает больше места на диске, чем процедурный. Это происходит потому, что в такой программе хранится больше конструкций, чем в обычной процедурной программе.
'''