# Изучите методы __init__(), __new__(), __del__() самостоятельно
#Декораторы @classmethod и @staticmethod

'''
Объявление функции внутри класса(метод) и вызов метода с помощью экземпляра класса

-----------------------------------------------
class Vector:
    def __init__(self, x=0, y=0):
        self.x = x
        self.y = y

    def get_coords(self):
        return self.x, self.y

v = Vector(1)
res = v.get_coords()
print(res)
-----------------------------------------------

Это объявление обычных стандартных методов класса. Помимо них можно объявить ещё 2 типа методов - это статические методы и методы класса. 

Методы класса объявляются с помощью декоратора @classmethod
Статические методы объявляются с помощью декоратора @staticmethod

----чтобы изучить или повторить декораторы можете перейти в файл decorator.py в этой же папке

-----------------------------------------------
class Vector:
    MIN_COORD = 0
    MAX_COORD = 100


    @classmethod
    def validate(cls, arg): #cls - ссылка на класс Vector
        return cls.MIN_COORD <= arg <= cls.MAX_COORD # с помощью cls мы можем ссылаться на атрибуты класса MIN_COORD и MAX_COORD


    def __init__(self, x=0, y=0):
        self.x = x
        self.y = y

    def get_coords(self):
        return self.x, self.y

v = Vector(1, 2)
print(Vector.validate(5)) # мы можем спокойно вызвать метод класса через сам класс, указав параметр arg при этом не указывая первый параметр cls
res = Vector.get_coords(v)
print(res)
-----------------------------------------------

Чем отличается метожд класса validate(cls, ...) от обычного метода get_coords(self).
В обычном методе идет параметр self и если при обращении к методу через класс мы его вызовем не указав аргументы, то увидим ошибку:

-----------------------------------------------
v = Vector(1, 2)
res = Vector.get_coords()
print(res)
-----------------------------------------------

То есть нам необходимо на уровне класса передать параметр v, а именно ссылку на экземпляр класса self:

-----------------------------------------------
v = Vector(1, 2)
res = Vector.get_coords(v)
print(res)
-----------------------------------------------

А если мы объявляем метод как просто метод класса, то мы его вызываем без каких либо дополнительных ссылок:

-----------------------------------------------
print(Vector.validate(5))
-----------------------------------------------

Здесь мы сразу прописываем параметр arg - значение 5

Появляется дополнительное удобство работы с методами на уровне класса, но при этом метод класса мы не мжем использовать для изменения каких-либо значений экземпляров этого класса то есть отдельных объектов этого класса, потому что по умолчанию у такого метода нет ссылки на объект с которым он мог бы работать. 
А в остальном методы класса и обычные метода ведут себя одинаково

-----------------------------------------------
class Vector:
    MIN_COORD = 0
    MAX_COORD = 100


    @classmethod
    def validate(cls, arg): #cls - ссылка на класс Vector
        return cls.MIN_COORD <= arg <= cls.MAX_COORD # с помощью cls мы можем ссылаться на атрибуты класса MIN_COORD и MAX_COORD


    def __init__(self, x, y):
        self.x = self.y = 0

        if self.validate(x) and self.validate(y): #self - ссылка на класс, таким образом такая запись становится универсальной для случая если мы захотим поменять имя класса, тогда нам не придется менять все записи
            self.x = x
            self.y = y

    def get_coords(self):
        return self.x, self.y

v = Vector(1, 200)
print(Vector.validate(5)) # мы можем спокойно вызвать метод класса через сам класс, указав параметр arg при этом не указывая первый параметр cls
res = Vector.get_coords(v)
print(res)
-----------------------------------------------

Теперь статический метод - @staticmethod
С помощью него мы можем определить методы которые не имеют доступа ни к атрибутам класса ни к атрибутам его экземпляра

-----------------------------------------------
class Vector:
    MIN_COORD = 0
    MAX_COORD = 100


    @classmethod
    def validate(cls, arg): #cls - ссылка на класс Vector
        return cls.MIN_COORD <= arg <= cls.MAX_COORD # с помощью cls мы можем ссылаться на атрибуты класса MIN_COORD и MAX_COORD


    def __init__(self, x, y):
        self.x = self.y = 0

        if self.validate(x) and self.validate(y):
            self.x = x
            self.y = y


        print(self.norm2(self.x, self.y))

    def get_coords(self):
        return self.x, self.y

    @staticmethod
    def norm2(x, y): #в результате мы имеем некую сервисную вспомогательную функцию, которая позволяет вычислять квадрат нормы для произвольного радиуса вектора
        return x*x + y*y

v = Vector(10, 20)
print(Vector.norm2(5, 6)) 
-----------------------------------------------

Таким образом мы можем прописывать статические методы в которых нет дополнительных параметров, кроме тех, что мы прописываем внутри функции.

Подведем итог.
--------------------------
Когда мы прописываем обычные методы таким образом: def __init__(self, x, y):...
или так: def get_coord(self):...
То мы предполагаем, что они вызываются из экземпляров класса и работают с атрибутами этого экземпляра через параметр self и также с атрибутами самого класса (MIN_COORD = 0, MAX_COORD = 100) - такие методы имеют доступ и к локальным свойствам экземпляра и к атрибутам самого класса

Если же предполагается определить метод который будет работать только с атрибутами класса: def validate(cls, arg):.......
То его следует определять как метод класса используя декоратор @classmethod
Здесь работать с локальными атрибутами экземпляра класса на прямую не получится, потому что просто нет ссылки на соответствующий экземпляр

Если нам необходимо определить какую-то независимую сервисную функцию, которая работала бы с параметрами определенными непосредственно в ней, то её следует поределить как статическую с помощью декоратора @staticmethod
'''

class Vector:
    MIN_COORD = 0
    MAX_COORD = 100


    @classmethod
    def validate(cls, arg): #cls - ссылка на класс Vector
        return cls.MIN_COORD <= arg <= cls.MAX_COORD # с помощью cls мы можем ссылаться на атрибуты класса MIN_COORD и MAX_COORD


    def __init__(self, x, y):
        self.x = self.y = 0

        if self.validate(x) and self.validate(y):
            self.x = x
            self.y = y


        print(self.norm2(self.x, self.y))

    def get_coords(self):
        return self.x, self.y

    @staticmethod
    def norm2(x, y): #в результате мы имеем некую сервисную вспомогательную функцию, которая позволяет вычислять квадрат нормы для произвольного радиуса вектора
        return x*x + y*y 

v = Vector(10, 20)
print(Vector.norm2(5, 6)) 

