# Изучите методы __init__(), __new__(), __del__() самостоятельно
#Декораторы @classmethod и @staticmethod

'''
Объявление функции внутри класса(метод) и вызов метода с помощью экземпляра класса

class Vector:
    def __init__(self, x=0, y=0):
        self.x = x
        self.y = y

    def get_coords(self):
        return self.x, self.y

v = Vector(1)
res = v.get_coords()
print(res)


Это объявление обычных стандартных методов класса. Помимо них можно объявить ещё 2 типа методов - это статические методы и методы класса. 

Методы класса объявляются с помощью декоратора @classmethod
Статические методы объявляются с помощью декоратора @staticmethod

----чтобы изучить или повторить декораторы можете перейти в файл decorator.py в этой же папке

'''





