'''
------------------------Принципы ООП------------------------

--------Абстракция-----------

Абстракция — это использование только тех характеристик объекта, которые с достаточной точностью представляют его в данной системе. Основная идея состоит в том, чтобы представить объект минимальным набором атрибутов и методов и при этом с достаточной точностью для решаемой задачи.

Абстракция является основой объектно-ориентированного программирования и позволяет работать с объектами, не вдаваясь в особенности их реализации. Пользователь типа не имеет прямого доступа к его реализации, но может работать с данными через предоставленный набор операций. Преимущество абстракции данных в разделении операций над данными и внутреннего представления этих данных, что позволяет изменять реализацию, не затрагивая пользователей данного типа.


--------Инкапсуляция-----------

Инкапсуляция имеет два основных смысла. С одной стороны, она объединяет атрибуты и методы в одном объекте. С другой стороны, инкапсуляция обозначает сокрытие данных, то есть невозможность напрямую получить доступ к внутренней структуре объекта, так как это может быть небезопасно. Например, наполнить желудок едой можно напрямую, положив еду в желудок. Но это опасно. Поэтому прямой доступ к желудку закрыт. Чтобы наполнить его едой, нужно совершить ритуал через элемент интерфейса под названием рот.

--Принцип инкапсуляции позволяет объектам содержать как свои данные, так и поведение, а также скрывать то, что ему потребуется, от внешнего программного кода.


--------Наследование-----------

Наследование — способ создания класса на основе уже существующего, при котором дочерний класс заимствует атрибуты и методы родительского класса, а также добавляет собственные. Дочерний класс часто называют производным классом, наследником или потомком, а родительский класс – предком или просто родителем.


--------Полиморфизм-----------

Полиморфизм в программировании — это способность одного и того же интерфейса (например, метода или функции) работать с разными типами данных или объектов.

Простыми словами: полиморфизм позволяет одному и тому же действию (например, вызову метода) вести себя по-разному в зависимости от того, с чем мы работаем.

Пример из жизни:

Представьте, что у вас есть кнопка "Играть". Она:

На музыкальном плеере запускает музыку.
На телевизоре запускает фильм.
В игре начинает игровой процесс.
Одна кнопка — много разных действий, в зависимости от устройства.
'''