class Point:
    color = 'red' # атрибут класса Point
    circle = 2

'''
1) открываем в терминале консоль Python с помощью команды python
2) присвоим атрибуду color новое значение (Point.color = 'black')
3) выведем атрибут для просмотра изменений (Point.color). Также можно присвоить результат атрибута какой-то переменной (result = Point.color). выведем переменную result (result). Попробуем вывести несуществующий артрибут класса Point (Point.unknown)
ошибки можно избежать с помощью функции getattr(Point, 'unknown', False) где аргумент аргумент(Point) - класс, второй аргумент('unknown') - несуществующий атрибут, третий аргумент(False) - значение, которое вернет функция, если атрибут не обнаружен. без 3 аргумента результат выполнения функции вернет ошибку при существующем атрибуте выведется значение атрибута. также в этом случае указывать 3 аргумент необязательно, если в существующем атрибуте есть значение
4) выведем коллекцию класса (Point.__dict__)
5) создаем экземпляр класса a (a = Point()) - внутри текущего пространства объекта a отсутсвуют атрибуты color и circle. экземпляр a просто ссылается на класс Point
6) выводим тип экземпляра (type(a))
7) выведем коллекцию dict для экземпляра a (a.__dict__)
8) присвоим экземпляру a значение (a.color = 'green') - через экзмепляр a мы обращаемся к пространству имен объекта a. далее с помощью оператора присваивания создается пременная с именем color в текущем пространстве имен.
9) теперь распечатаем коллекцию dict экземпляра a и посмотрим на изменения (a.__dict__)
10) По аналогии можно создавать новые атрибуты указывая имя класса. (Point.new_property = 'disc') также это можно сделать с помощью функции setattr(Point, 'new_property', 1) - где первый аргумент(Point) - класс, второй аргумент('new_property') - новое свойство, третий аргумент(1) - значение свойства. Если свойство уже существует, то при выполнении функции просто поменяется значение, если оно было другим
11) Также можно удалять атрибуты. (del Point.cricle). Если атрибута не существует, то при выполнении оператора выведется ошибка
12) Второй способ удаления атрибута - функция delattr(Point, 'circle'). Если атрибута не существует, то при выполнении оператора выведется ошибка
13) Прежде чем удалять атрибуты нужно проверять есть они или нет. для проверки существования атрибута можно использовать функцию hasattr(Point, 'prop') где 1 аргумент(Point) - это пространство имен(класс, экземпляр), 2 аргумент('prop') - атрибут, который мы хотим проверить. Если атрибута не существует, то выведется False, иначе True
14) Проверим как работают эти функции, используя в качестве пространства имен - экземпляр a
'''
