'''
Реализуйте функцию get_sum(), которая принимает два аргумента в следующем порядке:
a — вещественное число
b — вещественное число
Функция должна возвращать сумму чисел a и b

def get_sum(a, b):
    return a + b

a = float(input('Введите вещественное число 1: '))
b = float(input('Введите вещественное число 2: '))
print(get_sum(a, b))




Реализуйте функцию get_log(), которая принимает два аргумента в следующем порядке:
value — положительное число
base — положительное число, не равное 1, по умолчанию имеет значение 2
Функция должна возвращать логарифм числа value по основанию base
from math import log
def get_log(value, base=2):
    if value < 1:
        return 'Это не полжительное число'
    if base < 1:
        return 'Это не полжительное число'
    if base == 1:
        return 'Введите любое положительное число, кроме 1'
    return log(value, base)

value = int(input('Введите любое положительное число: '))
base = int(input('Введите любое положительное число, кроме 1: '))
print(get_log(value, base))
'''